[
  {
    "id": "110008",
    "members": [
      {
        "id": "991451439",
        "name": "Loella Beedon"
      },
      {
        "id": "991443976",
        "name": "Niven Anger"
      }
    ],
    "name": "Team RA",
    "status": "available",
    "description": "Magna elit nisi pariatur tempor quis labore cupidatat sunt cillum. Reprehenderit labore mollit tempor officia consectetur enim proident Lorem adipisicing dolore quis. Est fugiat ipsum ut occaecat laborum anim id in deserunt. Cillum commodo excepteur mollit veniam ad cupidatat consectetur elit enim veniam nostrud. Ea dolore sit non ad excepteur irure cillum excepteur nisi.\r\n"
  },
  {
    "id": "110366",
    "members": [
      {
        "id": "991437060",
        "name": "Sydel Mersching"
      },
      {
        "id": "991487493",
        "name": "Evelina Noddle"
      }
    ],
    "name": "Rule Breakers",
    "status": "available",
    "description": "Mollit ex irure dolor nulla incididunt aliquip elit sit excepteur ad eu et. Nisi dolor culpa deserunt nostrud sunt est amet. Do duis esse excepteur laborum laboris mollit reprehenderit eiusmod. Sunt mollit non est velit tempor do amet voluptate. Ea minim proident pariatur culpa et reprehenderit occaecat in velit.\r\n"
  },
  {
    "id": "110267",
    "members": [
      {
        "id": "991424219",
        "name": "Venus Dargue"
      }
    ],
    "name": "Team SPD",
    "status": "available",
    "description": "Consequat irure aliquip excepteur nostrud officia laboris id amet amet. Magna dolor esse non cillum elit id. Laborum officia commodo reprehenderit exercitation exercitation nisi laboris qui deserunt ullamco ea. Pariatur id laboris mollit enim sunt in enim labore officia qui excepteur enim adipisicing ullamco. Ex do nostrud irure do dolor ex aute consequat. Velit ullamco adipisicing occaecat cillum sint ad veniam est duis incididunt ipsum Lorem tempor.\r\n"
  },
  {
    "id": "110795",
    "members": [
      {
        "id": "991482457",
        "name": "Horatia Deporte"
      },
      {
        "id": "991499065",
        "name": "Kathie Knappett"
      },
      {
        "id": "991490312",
        "name": "Garrick Cassar"
      },
      {
        "id": "991487236",
        "name": "Celle Cattow"
      }
    ],
    "name": "Team Zest",
    "status": "full",
    "description": "Occaecat quis sunt esse est exercitation id reprehenderit dolor eu eu in ad. Duis sit sunt ex nulla adipisicing tempor id occaecat deserunt non sit ipsum. Anim ullamco culpa pariatur culpa aliquip ut quis velit duis. Pariatur sit sint nulla tempor laboris adipisicing esse quis fugiat laborum. Id est anim ad enim deserunt officia eiusmod irure quis incididunt. Irure labore esse duis mollit do consectetur anim sint. Laboris ea ullamco aliqua deserunt pariatur exercitation deserunt occaecat irure officia.\r\n"
  },
  {
    "id": "110146",
    "members": [
      {
        "id": "991477225",
        "name": "Carroll Ledekker"
      },
      {
        "id": "991488623",
        "name": "Opaline Mara"
      }
    ],
    "name": "Innovators",
    "status": "available",
    "description": "Dolore laboris veniam id qui quis ea consequat. Id fugiat non Lorem nostrud aliquip dolore sit ex sit laboris mollit. Deserunt duis aliqua laboris culpa labore adipisicing labore. Aliquip esse laboris culpa commodo cupidatat deserunt magna deserunt incididunt culpa duis sunt.\r\n"
  },
  {
    "id": "110821",
    "members": [
      {
        "id": "991474078",
        "name": "Lanna Baise"
      }
    ],
    "name": "Best or Rest",
    "status": "available",
    "description": "Amet magna velit culpa duis ut esse deserunt culpa ut culpa eu. Laboris ea aliquip elit in consequat mollit id. Adipisicing nulla culpa ea quis eiusmod quis excepteur elit consectetur dolor sunt. Dolor est incididunt labore aliquip ea dolore incididunt Lorem occaecat dolor ut. Cillum laboris deserunt reprehenderit veniam elit ad nostrud voluptate qui. Eu ad ipsum culpa laborum voluptate sint tempor laborum labore aute nulla Lorem id. Eiusmod pariatur ea exercitation adipisicing incididunt est in.\r\n"
  }
]
